Tin_Melt_Case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simplePCMFOam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          0.01;
writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   16;

runTimeModifiable true;

adjustTimeStep  no;

//maxCo           1;

//maxDeltaT       1;

//maxAlphaCo      1;

functions
{
    #includeFunc residuals

    fieldMinMax1
    {
        type                    fieldMinMax;
        libs                    ("libfieldFunctionObjects.so");
        writeControl            timeStep;
        writeInterval           1;
        writeToFile             yes;
        log                     yes;
        location                yes;
        mode                    magnitude;
        fields                  (U T);
    }

    globalTavg
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        enabled         true;
        writeControl    writeTime;
		writeFields  true;
        fields          (alpha2);
        operation       volAverage;
    }


}

// ************************************************************************* //
