Tin_Melt_Case/constant/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rhoRef              rhoRef [1 -3 0 0 0 0 0] 7500.00;		//Liquid density

k                   k [1 1 -3 -1 0 0 0] 60.00;			//Thermal condcutivity

mu                  mu [1 -1 -1 0 0 0 0] 6.0e-03;		//Dynamic viscosity

Cp                  Cp [0 2 -2 -1 0 0 0] 200.;		//Specific heat capacity

L 		    L [0 2 -2 0 0 0 0] 60000.;			//Latent heat of fusion

Tmelt 		    Tmelt [0 0 0 1 0 0 0] 505.;		//Melting temperature

Tl                  Tl [0 0 0 1 0 0 0] 505.;			//Liquidus temperature (= Melting temperature for isothermal melting)

Ts                  Ts [0 0 0 1 0 0 0] 505.;			//Solidus temperature (= Melting temperature for isothermal melting)

C 		    C [1 -3 -1 0 0 0 0] 1.0e+07;		//Morphology constant used by Voller and Brent

glRelax 	    glRelax [0 0 0 0 0 0 0] 1.0;		//Relaxation factor for the inner loop

q 	            q [0 0 0 0 0 0 0] 1e-3;			//Constant used by Voller and Brent to avoid division by zero

// ************************************************************************* //
