Tin_Melt_Case/constant/phaseChangeProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Prt       Prt [0 0  0 0 0 0 0] 0.04	;		//Liquid density

Hf       Hf [0 2 -2 0 0 0 0] 60000;		//Liquid density
A_mushy     [1 -3 -1 0 0 0 0] 1e7;
Tmelt       [0 0 0 1 0 0 0 ] 505.;
Tliq     [0 0 0 1 0 0 0 ] 505.;
Tsol     [0 0 0 1 0 0 0 ] 505.;
rhoS     dimDensity 7500;
CpS [0 2 -2 -1 0 0 0 ] 	200.;
Cp1 [0 2 -2 -1 0 0 0 ] 	200.;
Cp2 [0 2 -2 -1 0 0 0 ] 	200.;
kappaS [1 1 -3 -1 0 0 0 ] 60.;
beta [0 0 0 -1 0 0 0] 2.67e-4;
g [0 1 -2 0 0 0 0] (0.0 -10. 0.0);
// ************************************************************************* //
