Tin_Melt_Case/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.;

boundaryField
{
    floor
    {
        type            zeroGradient;
    }
    ceiling
    {
        type            zeroGradient;
    }
    left
    {
         type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }
   // #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
