Tin_Melt_Case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|T|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.0001;
    }

    "(U|T|k|epsilon)Final"
    {
        $T;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 3;
    nOuterCorrectors  3;
    nCorrectors       3;
    pRefCell          0;
    pRefValue         0;
}
/*
relaxationFactors
{
    equations
    {
        ".*"   1.0;
    }
}

*/


// ************************************************************************* //
